'---------------------------------------------------------------------------------------

Set oShell = CreateObject ("Wscript.Shell") 

'---------------------------------------------------------------------------------------
'---------------------------------------------------------------------------------------

CUR_DIR = oShell.CurrentDirectory + "\" ' это именно текущая, откуда вызов

Set objArgs = WScript.Arguments 

For I = 0 to objArgs.Count - 1
   '   WScript.Echo objArgs(I)
   
   filename = objArgs(i)
   ' filename = CUR_DIR + objArgs(i) ' сразу добавляем текущую папку?!
   ' так сделано в пакете TESTPO - лучше бы как-то изменить это!!
   
   args = args + filename + "  " 
Next

' а это не тоже самое?: НЕТ, ТАК  без файлов не работает!
'args = WScript.Arguments(0)

'------------------------------------------------------- 
 
VBS_DIR = CreateObject("Scripting.FileSystemObject").GetParentFolderName(WScript.ScriptFullName) + "\"

' WScript.Echo  VBS_DIR
' WScript.Echo  args

'-----------------------------------------------------------------------------------------

BAT_DIR = VBS_DIR
'BAT_DIR = VBS_DIR + "wemacs\"

' переходим в папку скрипта, стартуем бат-запускалку и возвращаемся в исходную папку 
'
cmd = "cmd /v:on /c " + "cd " + BAT_DIR + "&& run_emacs.bat " + args + " && cd " + CUR_DIR 

' а может не переходить, а сразу стартовать?
'
'cmd = "cmd /v:on /c " + VBS_DIR + "run_emacs.bat " + args 


oShell.Run  cmd, 0, False

'-----------------------------------------------------------------------------------------
'-----------------------------------------------------------------------------------------

Set oShell = Nothing
	
'-----------------------------------------------------------------------------------------
'-------------------------------------------------------------------------------------------
 
